"""
 Для настольной игры используются карточки с номерами от 1 до N. Одна карточка потерялась. Найдите ее, зная номера оставшихся карточек.

Дано число N, далее N − 1 номер оставшихся карточек (различные числа от 1 до N). Программа должна вывести номер потерянной карточки.

Для самых умных: массивами и аналогичными структурами данных пользоваться нельзя.
"""

total = 1
part_sum = 0

for i in range(2, int(input()) + 1):
    total += i
    part_sum += int(input())

print(total - part_sum)
